nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
        <register>
          <name>OPACR2</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC23</name>
              <description>Off-platform Peripheral Access Control 23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC22</name>
              <description>Off-platform Peripheral Access Control 22</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC21</name>
              <description>Off-platform Peripheral Access Control 21</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC20</name>
              <description>Off-platform Peripheral Access Control 20</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC19</name>
              <description>Off-platform Peripheral Access Control 19</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC18</name>
              <description>Off-platform Peripheral Access Control 18</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC17</name>
              <description>Off-platform Peripheral Access Control 17</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC16</name>
              <description>Off-platform Peripheral Access Control 16</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
