nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
    <peripheral>
      <name>DCDC</name>
      <description>DCDC</description>
      <groupName>DCDC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DCDC</name>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>REG0</name>
          <description>DCDC Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14030111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWD_ZCD</name>
              <description>Power Down Zero Cross Detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Zero cross detetion function powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Zero cross detetion function powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE_AUTO_CLK_SWITCH</name>
              <description>Disable Auto Clock Switch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>xtal_clk</name>
                  <description>If DISABLE_AUTO_CLK_SWITCH is set to 0 and 24M xtal is OK, the clock source will switch from internal ring OSC to 24M xtal automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel_clk</name>
                  <description>If DISABLE_AUTO_CLK_SWITCH is set to 1, SEL_CLK will determine which clock source the DCDC uses</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_CLK</name>
              <description>Select Clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>int_rng_osc</name>
                  <description>DCDC uses internal ring oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xtal_24M</name>
                  <description>DCDC uses 24M xtal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_OSC_INT</name>
              <description>Power down internal osc</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Internal oscillator powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Internal oscillator powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CUR_SNS_CMP</name>
              <description>Power down signal of the current detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Current Detector powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Current Detector powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUR_SNS_THRSH</name>
              <description>Current Sense (detector) Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>select_zero</name>
                  <description>150 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_one</name>
                  <description>250 mA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_two</name>
                  <description>350 mA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_three</name>
                  <description>450 mA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_four</name>
                  <description>550 mA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_five</name>
                  <description>650 mA</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_OVERCUR_DET</name>
              <description>Power down overcurrent detection comparator</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overcurrent detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overcurrent detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERCUR_TRIG_ADJ</name>
              <description>Overcurrent Trigger Adjust</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>select_zero</name>
                  <description>In Run Mode, 1 A. In Power Save Mode, 0.25 A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_one</name>
                  <description>In Run Mode, 2 A. In Power Save Mode, 0.25 A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_two</name>
                  <description>In Run Mode, 1 A. In Power Save Mode, 0.2 A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_three</name>
                  <description>In Run Mode, 2 A. In Power Save Mode, 0.2 A</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CMP_BATT_DET</name>
              <description>Power Down Battery Detection Comparator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Low voltage detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Low voltage detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_LP_OVERLOAD_SNS</name>
              <description>Low Power Overload Sense Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overload Detection in power save mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overload Detection in power save mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_HIGH_VOLT_DET</name>
              <description>Power Down High Voltage Detection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overvoltage detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overvoltage detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_OVERLOAD_THRSH</name>
              <description>Low Power Overload Threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>thrsh_32</name>
                  <description>32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>thrsh_64</name>
                  <description>64</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>thrsh_16</name>
                  <description>16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>thrsh_8</name>
                  <description>8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_OVERLOAD_FREQ_SEL</name>
              <description>Low Power Overload Frequency Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>eight_32k_cycle</name>
                  <description>eight 32k cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sixteen_32k_cycle</name>
                  <description>sixteen 32k cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_HIGH_HYS</name>
              <description>Low Power High Hysteric Value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lp_12p5mV</name>
                  <description>Adjust hysteretic value in low power to 12.5mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lp_25mV</name>
                  <description>Adjust hysteretic value in low power to 25mV</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CMP_OFFSET</name>
              <description>Power down output range comparator</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Output range comparator powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Output range comparator powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOK_DISABLE</name>
              <description>Disable xtalok detection circuit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable xtalok detection circuit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable xtalok detection circuit and always outputs OK signal &quot;1&quot;</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRENT_ALERT_RESET</name>
              <description>Reset Current Alert Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_reset</name>
                  <description>Current Alert Signal not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Current Alert Signal reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_24M_OK</name>
              <description>24M XTAL OK</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>int_rng_osc</name>
                  <description>DCDC uses internal ring OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xtal_24M</name>
                  <description>DCDC uses xtal 24M</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS_DC_OK</name>
              <description>DCDC Output OK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_settled</name>
                  <description>DCDC is settling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>settled</name>
                  <description>DCDC already settled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1</name>
          <description>DCDC Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x111BA29C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_FBK_SEL</name>
              <description>Select the feedback point of the internal regulator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>reg_fbk_sel0</name>
                  <description>The regulator outputs 1.0V with 1.2V reference voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_fbk_sel1</name>
                  <description>The regulator outputs 1.1V with 1.2V reference voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_fbk_sel2</name>
                  <description>The regulator outputs 1.0V with 1.3V reference voltage</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_fbk_sel3</name>
                  <description>The regulator outputs 1.1V with 1.3V reference voltage</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG_RLOAD_SW</name>
              <description>This controls the load resistor of the internal regulator of DCDC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>loadR_disconnect</name>
                  <description>Load resistor disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>loadR_connect</name>
                  <description>Load resistor connected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_CMP_ISRC_SEL</name>
              <description>Low Power Comparator Current Bias</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sel0</name>
                  <description>50 nA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel1</name>
                  <description>100 nA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel2</name>
                  <description>200 nA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel3</name>
                  <description>400 nA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCTRL_HST_THRESH</name>
              <description>Increase Threshold Detection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_hyst_thresh</name>
                  <description>Lower hysteresis threshold (about 2.5mV in typical, but this value can vary with PVT corners</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_hyst_thresh</name>
                  <description>Higher hysteresis threshold (about 5mV in typical)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCTRL_EN_HYST</name>
              <description>Enable Hysteresis</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable hysteresis in switching converter common mode analog comparators</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable hysteresis in switching converter common mode analog comparators</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBG_TRIM</name>
              <description>Trim Bandgap Voltage</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
