nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
                  <name>DIVIDE_62</name>
                  <description>mclk frequency = 1/62 * hmclk frequency</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_63</name>
                  <description>mclk frequency = 1/63 * hmclk frequency</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_64</name>
                  <description>mclk frequency = 1/64 * hmclk frequency</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_65</name>
                  <description>mclk frequency = 1/65 * hmclk frequency</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_66</name>
                  <description>mclk frequency = 1/66 * hmclk frequency</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_67</name>
                  <description>mclk frequency = 1/67 * hmclk frequency</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_68</name>
                  <description>mclk frequency = 1/68 * hmclk frequency</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_69</name>
                  <description>mclk frequency = 1/69 * hmclk frequency</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_70</name>
                  <description>mclk frequency = 1/70 * hmclk frequency</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_71</name>
                  <description>mclk frequency = 1/71 * hmclk frequency</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_72</name>
                  <description>mclk frequency = 1/72 * hmclk frequency</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_73</name>
                  <description>mclk frequency = 1/73 * hmclk frequency</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_74</name>
                  <description>mclk frequency = 1/74 * hmclk frequency</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_75</name>
                  <description>mclk frequency = 1/75 * hmclk frequency</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_76</name>
                  <description>mclk frequency = 1/76 * hmclk frequency</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_77</name>
                  <description>mclk frequency = 1/77 * hmclk frequency</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_78</name>
                  <description>mclk frequency = 1/78 * hmclk frequency</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_79</name>
                  <description>mclk frequency = 1/79 * hmclk frequency</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_80</name>
                  <description>mclk frequency = 1/80 * hmclk frequency</description>
                  <value>0x4F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_81</name>
                  <description>mclk frequency = 1/81 * hmclk frequency</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_82</name>
                  <description>mclk frequency = 1/82 * hmclk frequency</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_83</name>
                  <description>mclk frequency = 1/83 * hmclk frequency</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_84</name>
                  <description>mclk frequency = 1/84 * hmclk frequency</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_85</name>
                  <description>mclk frequency = 1/85 * hmclk frequency</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_86</name>
                  <description>mclk frequency = 1/86 * hmclk frequency</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_87</name>
                  <description>mclk frequency = 1/87 * hmclk frequency</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_88</name>
                  <description>mclk frequency = 1/88 * hmclk frequency</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_89</name>
                  <description>mclk frequency = 1/89 * hmclk frequency</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_90</name>
                  <description>mclk frequency = 1/90 * hmclk frequency</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_91</name>
                  <description>mclk frequency = 1/91 * hmclk frequency</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_92</name>
                  <description>mclk frequency = 1/92 * hmclk frequency</description>
                  <value>0x5B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_93</name>
                  <description>mclk frequency = 1/93 * hmclk frequency</description>
                  <value>0x5C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_94</name>
                  <description>mclk frequency = 1/94 * hmclk frequency</description>
                  <value>0x5D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_95</name>
                  <description>mclk frequency = 1/95 * hmclk frequency</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_96</name>
                  <description>mclk frequency = 1/96 * hmclk frequency</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_97</name>
                  <description>mclk frequency = 1/97 * hmclk frequency</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_98</name>
                  <description>mclk frequency = 1/98 * hmclk frequency</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_99</name>
                  <description>mclk frequency = 1/99 * hmclk frequency</description>
                  <value>0x62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_100</name>
                  <description>mclk frequency = 1/100 * hmclk frequency</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_101</name>
                  <description>mclk frequency = 1/101 * hmclk frequency</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_102</name>
                  <description>mclk frequency = 1/102 * hmclk frequency</description>
                  <value>0x65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_103</name>
                  <description>mclk frequency = 1/103 * hmclk frequency</description>
                  <value>0x66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_104</name>
                  <description>mclk frequency = 1/104 * hmclk frequency</description>
                  <value>0x67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_105</name>
                  <description>mclk frequency = 1/105 * hmclk frequency</description>
                  <value>0x68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_106</name>
                  <description>mclk frequency = 1/106 * hmclk frequency</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_107</name>
                  <description>mclk frequency = 1/107 * hmclk frequency</description>
                  <value>0x6A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_108</name>
                  <description>mclk frequency = 1/108 * hmclk frequency</description>
                  <value>0x6B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_109</name>
                  <description>mclk frequency = 1/109 * hmclk frequency</description>
                  <value>0x6C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_110</name>
                  <description>mclk frequency = 1/110 * hmclk frequency</description>
                  <value>0x6D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_111</name>
                  <description>mclk frequency = 1/111 * hmclk frequency</description>
                  <value>0x6E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_112</name>
                  <description>mclk frequency = 1/112 * hmclk frequency</description>
                  <value>0x6F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_113</name>
                  <description>mclk frequency = 1/113 * hmclk frequency</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_114</name>
                  <description>mclk frequency = 1/114 * hmclk frequency</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_115</name>
                  <description>mclk frequency = 1/115 * hmclk frequency</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_116</name>
                  <description>mclk frequency = 1/116 * hmclk frequency</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_117</name>
                  <description>mclk frequency = 1/117 * hmclk frequency</description>
                  <value>0x74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_118</name>
                  <description>mclk frequency = 1/118 * hmclk frequency</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_119</name>
                  <description>mclk frequency = 1/119 * hmclk frequency</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_120</name>
                  <description>mclk frequency = 1/120 * hmclk frequency</description>
                  <value>0x77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_121</name>
                  <description>mclk frequency = 1/121 * hmclk frequency</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_122</name>
                  <description>mclk frequency = 1/122 * hmclk frequency</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_123</name>
                  <description>mclk frequency = 1/123 * hmclk frequency</description>
                  <value>0x7A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_124</name>
                  <description>mclk frequency = 1/124 * hmclk frequency</description>
                  <value>0x7B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_125</name>
                  <description>mclk frequency = 1/125 * hmclk frequency</description>
                  <value>0x7C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_126</name>
                  <description>mclk frequency = 1/126 * hmclk frequency</description>
                  <value>0x7D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_127</name>
                  <description>mclk frequency = 1/127 * hmclk frequency</description>
                  <value>0x7E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_128</name>
                  <description>mclk frequency = 1/128 * hmclk frequency</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_129</name>
                  <description>mclk frequency = 1/129 * hmclk frequency</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_130</name>
                  <description>mclk frequency = 1/130 * hmclk frequency</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_131</name>
                  <description>mclk frequency = 1/131 * hmclk frequency</description>
                  <value>0x82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_132</name>
                  <description>mclk frequency = 1/132 * hmclk frequency</description>
                  <value>0x83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_133</name>
                  <description>mclk frequency = 1/133 * hmclk frequency</description>
                  <value>0x84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_134</name>
                  <description>mclk frequency = 1/134 * hmclk frequency</description>
                  <value>0x85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_135</name>
                  <description>mclk frequency = 1/135 * hmclk frequency</description>
                  <value>0x86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_136</name>
                  <description>mclk frequency = 1/136 * hmclk frequency</description>
                  <value>0x87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_137</name>
                  <description>mclk frequency = 1/137 * hmclk frequency</description>
                  <value>0x88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_138</name>
                  <description>mclk frequency = 1/138 * hmclk frequency</description>
                  <value>0x89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_139</name>
                  <description>mclk frequency = 1/139 * hmclk frequency</description>
                  <value>0x8A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_140</name>
                  <description>mclk frequency = 1/140 * hmclk frequency</description>
                  <value>0x8B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_141</name>
                  <description>mclk frequency = 1/141 * hmclk frequency</description>
                  <value>0x8C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_142</name>
                  <description>mclk frequency = 1/142 * hmclk frequency</description>
                  <value>0x8D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_143</name>
                  <description>mclk frequency = 1/143 * hmclk frequency</description>
                  <value>0x8E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_144</name>
                  <description>mclk frequency = 1/144 * hmclk frequency</description>
                  <value>0x8F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_145</name>
                  <description>mclk frequency = 1/145 * hmclk frequency</description>
                  <value>0x90</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_146</name>
                  <description>mclk frequency = 1/146 * hmclk frequency</description>
                  <value>0x91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_147</name>
                  <description>mclk frequency = 1/147 * hmclk frequency</description>
                  <value>0x92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_148</name>
                  <description>mclk frequency = 1/148 * hmclk frequency</description>
                  <value>0x93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_149</name>
                  <description>mclk frequency = 1/149 * hmclk frequency</description>
                  <value>0x94</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_150</name>
                  <description>mclk frequency = 1/150 * hmclk frequency</description>
                  <value>0x95</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_151</name>
                  <description>mclk frequency = 1/151 * hmclk frequency</description>
                  <value>0x96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_152</name>
                  <description>mclk frequency = 1/152 * hmclk frequency</description>
                  <value>0x97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_153</name>
                  <description>mclk frequency = 1/153 * hmclk frequency</description>
                  <value>0x98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_154</name>
                  <description>mclk frequency = 1/154 * hmclk frequency</description>
                  <value>0x99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_155</name>
                  <description>mclk frequency = 1/155 * hmclk frequency</description>
                  <value>0x9A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_156</name>
                  <description>mclk frequency = 1/156 * hmclk frequency</description>
                  <value>0x9B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_157</name>
                  <description>mclk frequency = 1/157 * hmclk frequency</description>
                  <value>0x9C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_158</name>
                  <description>mclk frequency = 1/158 * hmclk frequency</description>
                  <value>0x9D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_159</name>
                  <description>mclk frequency = 1/159 * hmclk frequency</description>
                  <value>0x9E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_160</name>
                  <description>mclk frequency = 1/160 * hmclk frequency</description>
                  <value>0x9F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_161</name>
                  <description>mclk frequency = 1/161 * hmclk frequency</description>
                  <value>0xA0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_162</name>
                  <description>mclk frequency = 1/162 * hmclk frequency</description>
                  <value>0xA1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_163</name>
                  <description>mclk frequency = 1/163 * hmclk frequency</description>
                  <value>0xA2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_164</name>
