nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
        <register>
          <name>MISC1</name>
          <description>Miscellaneous Register 1</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVDS1_CLK_SEL</name>
              <description>This field selects the clk to be routed to anaclk1/1b.Not related to PMU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PLL</name>
                  <description>ARM PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_PLL</name>
                  <description>System PLL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD4</name>
                  <description>ref_pfd4_clk == pll2_pfd0_clk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD5</name>
                  <description>ref_pfd5_clk == pll2_pfd1_clk</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD6</name>
                  <description>ref_pfd6_clk == pll2_pfd2_clk</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD7</name>
                  <description>ref_pfd7_clk == pll2_pfd3_clk</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_PLL</name>
                  <description>Audio PLL</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIDEO_PLL</name>
                  <description>Video PLL</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETHERNET_REF</name>
                  <description>ethernet ref clock (ENET_PLL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB1_PLL</name>
                  <description>USB1 PLL clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD0</name>
                  <description>ref_pfd0_clk == pll3_pfd0_clk</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD1</name>
                  <description>ref_pfd1_clk == pll3_pfd1_clk</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD2</name>
                  <description>ref_pfd2_clk == pll3_pfd2_clk</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD3</name>
                  <description>ref_pfd3_clk == pll3_pfd3_clk</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>xtal (24M)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDS2_CLK_SEL</name>
              <description>This field selects the clk to be routed to anaclk2/2b.Not related to PMU.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PLL</name>
                  <description>ARM PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_PLL</name>
                  <description>System PLL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD4</name>
                  <description>ref_pfd4_clk == pll2_pfd0_clk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD5</name>
                  <description>ref_pfd5_clk == pll2_pfd1_clk</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD6</name>
                  <description>ref_pfd6_clk == pll2_pfd2_clk</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD7</name>
                  <description>ref_pfd7_clk == pll2_pfd3_clk</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_PLL</name>
                  <description>Audio PLL</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIDEO_PLL</name>
                  <description>Video PLL</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MLB_PLL</name>
                  <description>MLB PLL</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETHERNET_REF</name>
                  <description>ethernet ref clock (ENET_PLL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCIE_REF</name>
                  <description>PCIe ref clock (125M)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SATA_REF</name>
                  <description>SATA ref clock (100M)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB1_PLL</name>
                  <description>USB1 PLL clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD0</name>
                  <description>ref_pfd0_clk == pll3_pfd0_clk</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD1</name>
                  <description>ref_pfd1_clk == pll3_pfd1_clk</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD2</name>
                  <description>ref_pfd2_clk == pll3_pfd2_clk</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD3</name>
                  <description>ref_pfd3_clk == pll3_pfd3_clk</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>xtal (24M)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDS1</name>
                  <description>LVDS1 (loopback)</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDS2</name>
                  <description>LVDS2 (not useful)</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDSCLK1_OBEN</name>
              <description>This enables the LVDS output buffer for anaclk1/1b</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDSCLK2_OBEN</name>
              <description>This enables the LVDS output buffer for anaclk2/2b</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDSCLK1_IBEN</name>
              <description>This enables the LVDS input buffer for anaclk1/1b</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDSCLK2_IBEN</name>
              <description>This enables the LVDS input buffer for anaclk2/2b</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD_480_AUTOGATE_EN</name>
              <description>This enables a feature that will clkgate (reset) all PFD_480 clocks anytime the USB1_PLL_480 is unlocked or powered off</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD_528_AUTOGATE_EN</name>
              <description>This enables a feature that will clkgate (reset) all PFD_528 clocks anytime the PLL_528 is unlocked or powered off</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_TEMPPANIC</name>
              <description>This status bit is set to one when the temperature sensor panic interrupt asserts for a panic high temperature</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_TEMPLOW</name>
              <description>This status bit is set to one when the temperature sensor low interrupt asserts for low temperature</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_TEMPHIGH</name>
              <description>This status bit is set to one when the temperature sensor high interrupt asserts for high temperature</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_ANA_BO</name>
              <description>This status bit is set to one when when any of the analog regulator brownout interrupts assert</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_DIG_BO</name>
              <description>This status bit is set to one when when any of the digital regulator brownout interrupts assert</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
