nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
        <register>
          <name>TEMPSENSE2_CLR</name>
          <description>Tempsensor Control Register 2</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOW_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a low alarm interrupt when the field is exceeded by TEMP_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANIC_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a panic interrupt when TEMP_CNT is smaller than this field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE2_TOG</name>
          <description>Tempsensor Control Register 2</description>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOW_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a low alarm interrupt when the field is exceeded by TEMP_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANIC_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a panic interrupt when TEMP_CNT is smaller than this field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB_ANALOG</name>
      <description>USB Analog</description>
      <alternatePeripheral>CCM_ANALOG</alternatePeripheral>
      <groupName>USB_ANALOG</groupName>
      <prependToName>USB_ANALOG_</prependToName>
      <baseAddress>0x400D8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x264</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>USB1_VBUS_DETECT</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_SET</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_CLR</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_TOG</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT</name>
          <description>USB Charger Detect Register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHK_CONTACT</name>
              <description>Check the contact of USB plug</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check the contact of USB plug.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether the USB plug has been in contact with each other</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHK_CHRG_B</name>
              <description>Check the charger connection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether a charger (either a dedicated charger or a host charger) is connected to USB port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check whether a charger is connected to the USB port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_B</name>
              <description>Control the charger detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the charger detector.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the charger detector.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT_SET</name>
          <description>USB Charger Detect Register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHK_CONTACT</name>
              <description>Check the contact of USB plug</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check the contact of USB plug.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether the USB plug has been in contact with each other</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHK_CHRG_B</name>
              <description>Check the charger connection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether a charger (either a dedicated charger or a host charger) is connected to USB port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check whether a charger is connected to the USB port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_B</name>
              <description>Control the charger detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the charger detector.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the charger detector.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT_CLR</name>
          <description>USB Charger Detect Register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHK_CONTACT</name>
              <description>Check the contact of USB plug</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check the contact of USB plug.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether the USB plug has been in contact with each other</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHK_CHRG_B</name>
              <description>Check the charger connection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether a charger (either a dedicated charger or a host charger) is connected to USB port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check whether a charger is connected to the USB port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_B</name>
              <description>Control the charger detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the charger detector.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the charger detector.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
