nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
        <register>
          <name>CTRL3</name>
          <description>Timer Channel Control Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OUTMODE</name>
              <description>Output Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNTER_ACTIVE</name>
                  <description>Asserted while counter is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OFLAG</name>
                  <description>Clear OFLAG output on successful compare</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OFLAG</name>
                  <description>Set OFLAG output on successful compare</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OFLAG_SUCCESS</name>
                  <description>Toggle OFLAG output on successful compare</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OFLAG_ALT</name>
                  <description>Toggle OFLAG output using alternating compare registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_ON_SECONDARY</name>
                  <description>Set on compare, cleared on secondary source input edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_ON_ROLLOVER</name>
                  <description>Set on compare, cleared on counter rollover</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_GATED_OUT</name>
                  <description>Enable gated clock output while counter is active</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COINIT</name>
              <description>Co-Channel Initialization</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Co-channel counter/timers cannot force a re-initialization of this counter/timer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Co-channel counter/timers may force a re-initialization of this counter/timer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Count Direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNTUP</name>
                  <description>Count up.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTDOWN</name>
                  <description>Count down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LENGTH</name>
              <description>Count Length</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNTIL_ROLLOVER</name>
                  <description>Count until roll over at $FFFF and continue from $0000.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNTIL_COMPARE</name>
                  <description>Count until compare, then re-initialize. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, alternating values of COMP1 and COMP2 are used to generate successful comparisons. For example, the counter counts until a COMP1 value is reached, re-initializes, counts until COMP2 value is reached, re-initializes, counts until COMP1 value is reached, and so on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONCE</name>
              <description>Count Once</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPEAT</name>
                  <description>Count repeatedly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNTIL_COMPARE</name>
                  <description>Count until compare and then stop. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, the counter re-initializes after reaching the COMP1 value, continues to count to the COMP2 value, and then stops.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Secondary Count Source</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNTER0_IN</name>
                  <description>Counter 0 input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER1_IN</name>
                  <description>Counter 1 input pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER2_IN</name>
                  <description>Counter 2 input pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER3_IN</name>
                  <description>Counter 3 input pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCS</name>
              <description>Primary Count Source</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNTER0_IN</name>
                  <description>Counter 0 input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER1_IN</name>
                  <description>Counter 1 input pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER2_IN</name>
                  <description>Counter 2 input pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER3_IN</name>
                  <description>Counter 3 input pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER0_OUT</name>
                  <description>Counter 0 output</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER1_OUT</name>
                  <description>Counter 1 output</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER2_OUT</name>
                  <description>Counter 2 output</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER3_OUT</name>
                  <description>Counter 3 output</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY1</name>
                  <description>IP bus clock divide by 1 prescaler</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY2</name>
                  <description>IP bus clock divide by 2 prescaler</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY4</name>
                  <description>IP bus clock divide by 4 prescaler</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY8</name>
                  <description>IP bus clock divide by 8 prescaler</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY16</name>
                  <description>IP bus clock divide by 16 prescaler</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY32</name>
                  <description>IP bus clock divide by 32 prescaler</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY64</name>
                  <description>IP bus clock divide by 64 prescaler</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DIVBY128</name>
                  <description>IP bus clock divide by 128 prescaler</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Count Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOOP</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_ONLY</name>
                  <description>Count rising edges of primary sourceRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1. If the primary count source is IP bus clock divide by 1, only rising edges are counted regardless of the value of SCTRL[IPS].</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_AND_FALLING</name>
                  <description>Count rising and falling edges of primary sourceIP bus clock divide by 1 cannot be used as a primary count source in edge count mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_WHILE_SEC_HIGH</name>
                  <description>Count rising edges of primary source while secondary input high active</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUADRATURE</name>
                  <description>Quadrature count mode, uses primary and secondary sources</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_SEC_DIR</name>
                  <description>Count rising edges of primary source; secondary source specifies directionRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECONDARY</name>
                  <description>Edge of secondary source triggers primary count until compare</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CASCADE</name>
                  <description>Cascaded counter mode (up/down)The primary count source must be set to one of the counter outputs.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRL3</name>
          <description>Timer Channel Status and Control Register</description>
          <addressOffset>0x6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OEN</name>
              <description>Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>The external pin is configured as an input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFLAG_OUT</name>
                  <description>The OFLAG output signal is driven on the external pin. Other timer groups using this external pin as their input see the driven value. The polarity of the signal is determined by OPS.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPS</name>
              <description>Output Polarity Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>True polarity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>Inverted polarity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE</name>
              <description>Force OFLAG Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL</name>
              <description>Forced OFLAG Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EEOF</name>
              <description>Enable External OFLAG Force</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSTR</name>
              <description>Master Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTURE_MODE</name>
              <description>Input Capture Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Capture function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_RISING</name>
                  <description>Load capture register on rising edge (when IPS=0) or falling edge (when IPS=1) of input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_FALLING</name>
                  <description>Load capture register on falling edge (when IPS=0) or rising edge (when IPS=1) of input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_BOTH</name>
                  <description>Load capture register on both edges of input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT</name>
              <description>External Input Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPS</name>
              <description>Input Polarity Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IEFIE</name>
              <description>Input Edge Flag Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IEF</name>
              <description>Input Edge Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFIE</name>
              <description>Timer Overflow Flag Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOF</name>
              <description>Timer Overflow Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCFIE</name>
              <description>Timer Compare Flag Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCF</name>
              <description>Timer Compare Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPLD13</name>
          <description>Timer Channel Comparator Load Register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARATOR_LOAD_1</name>
              <description>COMPARATOR_LOAD_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPLD23</name>
          <description>Timer Channel Comparator Load Register 2</description>
          <addressOffset>0x72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARATOR_LOAD_2</name>
              <description>COMPARATOR_LOAD_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
