nxp-mcuxpresso/mcux-soc-svd/MIMXRT1041/MIMXRT1041.xml
        <register>
          <name>CH0SEMA</name>
          <description>DCP channel 0 semaphore register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INCREMENT</name>
              <description>The value written to this field is added to the semaphore count in an atomic way such that the simultaneous software adds and DCP hardware substracts happening on the same clock are protected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>This read-only field shows the current (instantaneous) value of the semaphore counter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0STAT</name>
          <description>DCP channel 0 status register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload, or when writing the status back to the packet payload</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates the additional error codes for some of the error conditions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error signalled because the next pointer is 0x00000000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error signalled because the semaphore is non-zero and neither chain bit is set</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the context buffer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the payload</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error signalled because the control packet specifies an invalid mode select (for instance, blit + hash)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0STAT_SET</name>
          <description>DCP channel 0 status register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload, or when writing the status back to the packet payload</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates the additional error codes for some of the error conditions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error signalled because the next pointer is 0x00000000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error signalled because the semaphore is non-zero and neither chain bit is set</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the context buffer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the payload</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error signalled because the control packet specifies an invalid mode select (for instance, blit + hash)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0STAT_CLR</name>
          <description>DCP channel 0 status register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload, or when writing the status back to the packet payload</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates the additional error codes for some of the error conditions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error signalled because the next pointer is 0x00000000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error signalled because the semaphore is non-zero and neither chain bit is set</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the context buffer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the payload</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error signalled because the control packet specifies an invalid mode select (for instance, blit + hash)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0STAT_TOG</name>
          <description>DCP channel 0 status register</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload, or when writing the status back to the packet payload</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates the additional error codes for some of the error conditions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error signalled because the next pointer is 0x00000000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error signalled because the semaphore is non-zero and neither chain bit is set</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the context buffer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error signalled because an error is reported reading/writing the payload</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error signalled because the control packet specifies an invalid mode select (for instance, blit + hash)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0OPTS</name>
          <description>DCP channel 0 options register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0OPTS_SET</name>
          <description>DCP channel 0 options register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0OPTS_CLR</name>
          <description>DCP channel 0 options register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0OPTS_TOG</name>
          <description>DCP channel 0 options register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CMDPTR</name>
          <description>DCP channel 1 command pointer address register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Pointer to the descriptor structure to be processed for channel 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1SEMA</name>
          <description>DCP channel 1 semaphore register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INCREMENT</name>
              <description>The value written to this field is added to the semaphore count in an atomic way, such that the simultaneous software adds and the DCP hardware substracts happening on the same clock are protected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>This read-only field shows the current (instantaneous) value of the semaphore counter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
